Repository: erfan1hemmat/todo_list
Catalog: lib/l10n/app_*.arb
Languages: fa

# appTitle
source: Todo App
fa: برنامه انجام کارها

source: Hello World
fa: سلام دنیا

source: Tasks
fa: کارها

source: Search tasks...
fa: جستجوی کارها...

# noResultsFound
source: No results found for '{query}'
fa: نتیجه‌ای برای '{query}' یافت نشد

source: No active tasks
fa: هیچ کار فعالی وجود ندارد

source: Home
fa: خانه

source: Completed
fa: انجام شده ها

source: Completed Tasks
fa: تسک‌های انجام شده

source: No completed tasks
fa: هیچ کار انجام شده‌ای وجود ندارد

source: No description
fa: توضیحی وجود ندارد

source: Close
fa: بستن

source: Delete Task
fa: حذف کار

# areYouSureDelete
source: Are you sure you want to delete '{title}'?
fa: آیا مطمئن هستید که '{title}' حذف شود؟

source: Yes, Delete
fa: بله، حذف شود

source: No
fa: خیر

source: Due Date
fa: تاریخ سررسید

source: Easy
fa: آسان

source: Medium
fa: متوسط

source: Hard
fa: سخت

source: Deleted
fa: حذف شد

# taskDeleted
source: Task '{title}' deleted
fa: کار '{title}' حذف شد

source: Add New Task
fa: افزودن کار جدید

source: Enter task title...
fa: عنوان کار را وارد کنید...

# titleRequired
source: Title is required
fa: عنوان الزامی است

source: Enter task description...
fa: توضیحات کار را وارد کنید...

source: CreatedAt
fa: ساخته شده در

source: Not set
fa: تعیین نشده

source: Difficulty Level
fa: سطح دشواری

source: Save Task
fa: ذخیره کار

source: Success
fa: موفق

# taskAdded
source: Task «{title}» added
fa: کار «{title}» اضافه شد

source: Error
fa: خطا

# saveFailed
source: Save failed: {error}
fa: ذخیره ناموفق: {error}

source: Mark as Done
fa: انجام شد

# areYouSureMarkDone
source: Are you sure you want to mark '{title}' as done?
fa: آیا مطمئن هستید که '{title}' انجام شود؟

source: Done
fa: انجام شد

# taskCompleted
source: Task '{title}' completed!
fa: کار '{title}' انجام شد!

source: Progress
fa: پیشرفت

# daysRemaining
source: {days} days left
fa: {days} روز باقی مانده

source: Overdue!
fa: تاریخ گذشته!

source: Less than a minute remaining
fa: کمتر از یک دقیقه باقی مانده

# hoursRemaining
source: {hours} hours remaining
fa: {hours} ساعت باقی مانده

# minutesRemaining
source: {minutes} minutes remaining
fa: {minutes} دقیقه باقی مانده

# darkmode
source: Dark Mode Activated
fa: حالت شب فعال شد

# lightmode
source: Light Mode Activated
fa: حالت روز فعال شد
